// 1949年 - 2100年 农历年份  >> 注:使用时是 10进制 并非 16进制
// 1996年 原本是0x055c0; 百度、微软、app日历都为0x05ac0

const LANR_ARR = [
  0x0b557, //1949
  0x06ca0, 0x0b550, 0x15355, 0x04da0, 0x0a5b0, 0x14573, 0x052b0, 0x0a9a8, 0x0e950, 0x06aa0, //1950-1959
  0x0aea6, 0x0ab50, 0x04b60, 0x0aae4, 0x0a570, 0x05260, 0x0f263, 0x0d950, 0x05b57, 0x056a0, //1960-1969
  0x096d0, 0x04dd5, 0x04ad0, 0x0a4d0, 0x0d4d4, 0x0d250, 0x0d558, 0x0b540, 0x0b6a0, 0x195a6, //1970-1979
  0x095b0, 0x049b0, 0x0a974, 0x0a4b0, 0x0b27a, 0x06a50, 0x06d40, 0x0af46, 0x0ab60, 0x09570, //1980-1989
  0x04af5, 0x04970, 0x064b0, 0x074a3, 0x0ea50, 0x06b58, 0x05ac0, 0x0ab60, 0x096d5, 0x092e0, //1990-1999
  0x0c960, 0x0d954, 0x0d4a0, 0x0da50, 0x07552, 0x056a0, 0x0abb7, 0x025d0, 0x092d0, 0x0cab5, //2000-2009
  0x0a950, 0x0b4a0, 0x0baa4, 0x0ad50, 0x055d9, 0x04ba0, 0x0a5b0, 0x15176, 0x052b0, 0x0a930, //2010-2019
  0x07954, 0x06aa0, 0x0ad50, 0x05b52, 0x04b60, 0x0a6e6, 0x0a4e0, 0x0d260, 0x0ea65, 0x0d530, //2020-2029
  0x05aa0, 0x076a3, 0x096d0, 0x04afb, 0x04ad0, 0x0a4d0, 0x1d0b6, 0x0d250, 0x0d520, 0x0dd45, //2030-2039
  0x0b5a0, 0x056d0, 0x055b2, 0x049b0, 0x0a577, 0x0a4b0, 0x0aa50, 0x1b255, 0x06d20, 0x0ada0, //2040-2049
  0x14b63, 0x09370, 0x049f8, 0x04970, 0x064b0, 0x168a6, 0x0ea50, 0x06b20, 0x1a6c4, 0x0aae0, //2050-2059
  0x0a2e0, 0x0d2e3, 0x0c960, 0x0d557, 0x0d4a0, 0x0da50, 0x05d55, 0x056a0, 0x0a6d0, 0x055d4, //2060-2069
  0x052d0, 0x0a9b8, 0x0a950, 0x0b4a0, 0x0b6a6, 0x0ad50, 0x055a0, 0x0aba4, 0x0a5b0, 0x052b0, //2070-2079
  0x0b273, 0x06930, 0x07337, 0x06aa0, 0x0ad50, 0x14b55, 0x04b60, 0x0a570, 0x054e4, 0x0d160, //2080-2089
  0x0e968, 0x0d520, 0x0daa0, 0x16aa6, 0x056d0, 0x04ae0, 0x0a9d4, 0x0a2d0, 0x0d150, 0x0f252, //2090-2099
  0x0d520 //2100
]

const BASIS = 1949 // 农历 基准年


const LUNAR_MONTH = ['正', '二', '三', '四', '五', '六', '七', '八', '九', '十', '冬', '腊'], // 中文月份
      LUNAR_DAY   = ['一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '初', '廿']; // 中文日份


const TIANGAN   = {
        4: '甲',
        5: '乙',
        6: '丙',
        7: '丁',
        8: '戊',
        9: '己',
        0: '庚',
        1: '辛',
        2: '壬',
        3: '癸'
      }, // 天干
      DIZHI     = {
        4 : '子',
        5 : '丑',
        6 : '寅',
        7 : '卯',
        8 : '辰',
        9 : '巳',
        10: '午',
        11: '未',
        0 : '申',
        1 : '酉',
        2 : '戌',
        3 : '亥',
      }, // 地支
      SHENGXIAO = {
        4 : '鼠',
        5 : '牛',
        6 : '虎',
        7 : '兔',
        8 : '龙',
        9 : '蛇',
        10: '马',
        11: '羊',
        0 : '猴',
        1 : '鸡',
        2 : '狗',
        3 : '猪',
      }; // 生肖

const year = new Date().getFullYear()
const da_xue = year === 2020 ? 484972 : 483532
// 2020年节气 大雪 与百度、手机日历、微软日历相差一天、其余年正常。先做 if。

const SOLAR_TERMS_CN  = ['小寒', '大寒', '立春', '雨水', '惊蛰', '春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪','冬至'],
      SOLAR_TERMS_MIN = [0,21208,42467,63836,85337,107014,128867,150921,173149,195551,218072,240693,263343,285989,308563,331033,353350,375494,397447,419210,440795,462224,da_xue,504758]; // 节点点时间, 0为小寒, 单位 分钟

const LUNAR_FESTIVAL = {
        '1223': '北方小年',
        '1224': '南方小年',
        '1230': '除夕',
        '0101': '春节',
        '0115': '元宵',
        '0202': '龙抬头',
        '0505': '端午节',
        '0707': '七夕',
        '0815': '中秋节',
        '0909': '重阳节',
        '1013': '阳历生日',
        '1208': '腊八'
      },
      SOLAR_FESTIVAL = {
        '0101': '元旦',
        '0214': '情人节',
        '0308': '妇女节',
        '0312': '植树节',
        '0315': '消费者日',
        '0401': '愚人节',
        '0501': '劳动节',
        '0504': '青年节',
        '0512': '护士节',
        '0601': '儿童节',
        '0701': '建党日',
        '0801': '建军节',
        '0910': '教师节',
        '0918': '九一八',
        '1001': '国庆节',
        '1013': '阴历生日',
        '1111': '光棍节',
        '1224': '平安夜',
        '1225': '圣诞节'
      };

module.exports = {
  LANR_ARR,
  BASIS,
  LUNAR_MONTH,
  LUNAR_DAY,
  TIANGAN,
  DIZHI,
  SHENGXIAO,
  SOLAR_TERMS_CN,
  SOLAR_TERMS_MIN,
  LUNAR_FESTIVAL,
  SOLAR_FESTIVAL,
}
